# -*-coding:utf-8-*-
import os ,sys
sys.path.append('E:\Pydemo\python_test\python_test')
import http
import json
import random
import urllib.request
import urllib.parse
import unittest

#线下接口searchDrug

http://www.sceea.cn/InformationOpenness/GetSunshineList

#参数
#请求头
headers={'Content-Type': 'text/html','charset':'utf-8','Connection': 'keep-alive'}

#关键字
keyworlds = ['\ufeffaad', 'aad', 'aad', 'aakl', 'aary', 'ab', 'ab', 'ab', 'ab', 'ab', 'ab', 'ab', 'ab', 'abd', 'abdd', 'abde', 'abdz', 'abdz', 'abf', 'abhgx', 'abhx', 'abkw', 'abky', 'abl', 'abl', 'abl', 'abla', 'abla', 'ablk', 'abn', 'abn', 'abp', 'abq', 'abqmsbhs', 'abqmsgtj', 'abqmsns', 'abqn', 'abs', 'absx', 'abt', 'abt', 'abt', 'abt', 'abtw', 'abw', 'abwmp', 'abx', 'abx', 'abx', 'abxk', 'abxl', 'ac', 'ac', 'ac', 'achksp', 'acj', 'acmsd', 'acn', 'acp', 'acs', 'ad', 'ad', 'ad', 'ad', 'ad', 'ad', 'adbk', 'adc', 'adek', 'adf', 'adf', 'adf', 'adfk', 'adfn', 'adfn', 'adfwz', 'adgs', 'adh', 'adj', 'adkw', 'adl', 'adl', 'adl', 'adl', 'adln', 'adm', 'adm', 'adm', 'adme', 'admn', 'adn', 'adp', 'adp', 'adpl', 'adq', 'adq', 'ads', 'ads', 'adsc', 'adsq', '龟龙中风', '龟龄集', '龟黄补', '龟鹿补肾', '龟鹿益肾', '龟鹿滋肾', '龟鹿宁神', '龟鹿二胶丸', '龟鹿二仙', '龟蛇酒', '龟蛇洒', '龟茸壮骨', '龟苓膏', '龟芪壮骨', '龟芪参', '龟胶养阴颗粒', '龟胶', '龟甲胶', '龟甲散', '龟甲拉颗粒', '龟甲养阴', '龟甲', '龟灵益肾', '龙齿', '龙黄补血口服液', '龙鹿丸', '龙鹿', '龙骨颈椎', '龙香平喘', '龙首颗粒', '龙首', '龙金通淋', '龙血竭', '龙蛾酒', '龙蛭胶囊', '龙虱补肾', '龙虎人丹', '龙菊清肝', '龙荟丸', '龙荟', '龙苓春', '龙芪溶栓', '龙脑安神丸', '龙胜泰', '龙胆酊', '龙胆草', '龙胆苏打', '龙胆紫溶液', '龙胆碳酸氢钠', '龙胆浸膏', '龙胆泻肝', '龙胆总苷', '龙胆丸', '龙胆', '龙眼肉', '龙百利', '龙生蛭', '龙琥醒脑颗粒', '龙珠软膏', '龙珠平亢', '龙珠', '龙牡壮骨', '龙牙肝泰', '龙燕补肾酒', '龙灯胶囊', '龙灯', '龙源惠康', '龙枣胶囊', '龙枣', '龙掌口含液', '龙掌', '龙心素', '龙威欣', '龙参补益膏', '龙化素', '龙勃', '龙凤宝', '龙丹通络胶囊', '龙七胃康', '龋齿宁', '齿痛消炎灵', '齿痛宁', '齿痛冰硼', '齐隆迈', '齐铭雷奥', '齐迈宁', '齐诺', '齐索', '齐素', '齐洛', '齐斯丁', '齐敦果酸片', '齐征', '齐宏', '齐多拉米双夫定片', '齐多夫定', '齐复', '齐墩果酸', '齐培丙醇', '齐吉']
#分类编号
cateId = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15', '16', '17', '18', '19', '1000', '1001', '1002', '1003', '1004', '1005', '1006', '1007', '1008', '1009', '1010', '1011', '1012', '1013', '1014', '1015', '1016', '1017', '1018', '1019', '1020', '1021', '1022', '1023', '1024', '1025', '1026', '1027', '1028', '1029', '1030', '1031', '1032', '1033', '1034', '1035', '1036', '1037', '1038', '1039', '1040', '1041', '1042', '1043', '1044', '1045', '1046', '1047', '1048', '1049', '1050', '1051', '1052', '1053', '1054', '1055', '1056', '1057', '1058', '1059', '1060', '1061', '1062', '1063', '1064', '1065', '1066', '1067', '1068', '1069', '1070', '1071', '1072', '1073', '1074', '1075', '1076', '1077', '1078', '1079', '1080', '1081', '1082', '1083', '1084', '1085', '1086', '1087', '1088', '1089', '1090', '1091', '1092', '1093', '1094', '1095', '1096', '1097', '1098', '1099', '1100', '1101', '1102', '1103', '1104', '1105', '1106', '1107', '1108', '1109', '1110', '1111', '1112', '1113', '1114', '1115', '1116', '1117', '1118', '1119', '1120', '1121', '1122', '1123', '1124', '1125', '1126', '1127', '1128', '1129', '1130', '1131', '1132', '1133', '1134', '1135', '1136', '1137', '1138', '1139', '1140', '1141', '1142', '1143', '1144', '1145', '1154', '1155', '1177', '1178', '1179', '1180', '1181', '1183', '1203', '1225', '1242', '1262', '1282', '1302', '1303', '1304', '1305', '1306', '1307', '1308', '1312', '1310', '1311', '1315', '1316', '1317', '1318', '1319', '1320', '1321', '1322', '1323', '1324', '1325', '1326']
# 连锁编号
chainId = ['7433', '7434', '7435', '7436', '7437', '7438', '7439', '7440', '7441', '7442', '7443', '7444', '7445', '7446', '7447', '7448', '7465', '7466', '7467', '7468', '7469', '7470', '7471', '7472', '7473', '7474', '7475', '7485', '7486', '7487', '7488', '7489', '7490', '7491', '7505', '7506', '7507', '7508', '7525', '7526', '7545', '7546', '7547', '7548', '7565', '7566', '7567', '7568', '7569', '7570', '7571', '7572', '7573', '7574', '7575', '7576', '7577', '7585', '7586', '7587', '7588', '7589', '7590', '7591', '7605', '7606', '7625', '7626', '7627', '7645', '7646', '7647', '7648', '7649', '7650', '7651', '7652', '7653', '7654', '7655', '7656', '7657', '7658', '7659', '7660', '7661', '7665', '7666', '7685', '7686', '7687', '7688', '7689', '7690', '7705', '7725', '7726', '7727', '7728', '7729', '7730', '7731', '7732', '7733', '7734', '7735', '7736', '7737', '7738', '7739', '7745', '7746', '7747', '7748', '7765', '7766', '7767', '7768', '7785', '7786', '7805', '7806', '7807', '7808', '7809', '7810', '7811', '7812', '7813', '7814', '7815', '7816', '7817', '7818', '7819', '7820', '7821', '7823', '7824', '7827', '7829', '7831', '7832', '7833', '7834', '7835', '7836', '7837', '7838', '7839', '7841', '7842', '7844', '7845', '7846', '7847', '7848', '7850', '7851', '7852', '7853', '7854', '7855', '7856', '7858', '7859', '7862', '7863', '7865', '7869', '7870', '7871', '7872', '7873', '7874', '7875', '7876', '7878', '7879', '7880', '7881', '7882', '7883', '7884', '7885', '7886', '7887', '7889', '7890', '7892', '7894', '7898', '7899', '7902', '7903', '7905', '7909', '7910', '7916', '7922']
#药店编号
storeId =['22', '62', '148', '159', '160', '161', '163', '173', '180', '187', '190', '198', '199', '202', '205', '206', '208', '218', '225', '227', '237', '238', '239', '244', '245', '248', '249', '250', '252', '254', '274', '280', '281', '284', '285', '289', '296', '303', '304', '313', '314', '321', '325', '328', '333', '346', '347', '348', '353', '354', '356', '361', '364', '378', '382', '393', '395', '396', '400', '401', '403', '406', '408', '409', '424', '430', '431', '436', '437', '443', '447', '464', '466', '469', '472', '474', '477', '479', '490', '495', '497', '503', '506', '526', '537', '539', '540', '548', '561', '562', '564', '566', '571', '572', '575', '576', '657', '658', '659', '666', '684', '835', '844', '847', '849', '857', '858', '862', '867', '869', '870', '871', '872', '876', '888', '890', '891', '897', '1025', '1031', '1034', '1038', '1047', '1048', '1058', '1060', '1065', '1091', '1094', '1099', '1143', '1144', '1147', '1148', '1149', '1151', '1154', '1174', '1193', '1201', '1203', '1205', '1217', '1219', '1231', '1233', '1236', '1246', '1248', '1252', '1253', '1305', '1306', '1308', '1312', '1313', '1314', '1316', '1578', '1581', '1598', '1609', '1650', '1853', '1856', '1902', '1908', '1909', '1912', '1913', '1943', '2044', '2087', '2291', '2419', '2572', '2581', '2753', '2783', '2787', '2800', '2801', '2802', '2808', '2815', '2820', '2823', '2842', '2843', '2847', '2848', '2887', '2892', '2933', '2999', '3044', '3110', '3127', '3170', '3189', '3365']


def set_up():
    print('test_case running')

def tear_down():
    print('cases finished')

def test_chianSellDrug():
    '''连锁售药模糊查询,
    type = 0,连锁;click = 0 模糊'''
    i = random.randint(0,199)
    j = random.randint(0,199)
    param = {"cateGoryId":cateId[i],"storeId":storeId[i],"chainId":chainId[i],"click":0,"type":0,"page":1,"rows":15,"text":keyworlds[j]}
    data1 = json.dumps(param)
    data2 =bytes(data1,'utf8')
    conn = urllib.request.Request('http://114.215.254.11:8081/drugService/pharm/searchDrug',data = data2,headers=headers,method='POST')
    response = urllib.request.urlopen(conn)
    page = response.read()
    page = page.decode('utf-8')
    print(page)


def test_chainSellDrug_cate():
    '''连锁售药分类查询
    type = 0,连锁;click = 1/2 分类'''
    i = random.randint(0, 199)
    j = random.randint(0, 199)
    param = {"cateGoryId": cateId[i], "chainId": chainId[i], "storeId":storeId[j],"click": 1, "type": 0, "page": 1, "rows": 15,"text":keyworlds[j]}
    conn = urllib.request.Request('http://114.215.254.11:8081/drugService/pharm/searchDrug',bytes(json.dumps(param),'utf8') , headers,method='POST')
    response = urllib.request.urlopen(conn)
    page = response.read()
    page = page.decode('utf-8')
    print(page)


def test_storeSellDrug():
    '''药店售药模糊查询
    type = 1,药店;click = 0 模糊'''
    i = random.randint(0, 199)
    j = random.randint(0, 199)
    param = {"cateGoryId": cateId[i], "storeId":storeId[i], "click": 0, "type": 1, "page": 1, "rows": 15, "text": keyworlds[j]}
    conn = urllib.request.Request( 'http://114.215.254.11:8081/drugService/pharm/searchDrug',bytes(json.dumps(param),'utf8') , headers,method='POST')
    response = urllib.request.urlopen(conn)
    page = response.read()
    page = page.decode('utf-8')
    print(page)


def test_storeSellDrug_cate():
    '''药店售药分类查询
    type =1 药店，click =1 /2 分类'''
    i = random.randint(0, 199)
    j = random.randint(0, 199)
    param = {"cateGoryId": cateId[i], "storeId":storeId[i], "click": 2, "type": 1, "page": 1, "rows": 15, "text": keyworlds[j]}
    conn = urllib.request.Request('http://114.215.254.11:8081/drugService/pharm/searchDrug',bytes(json.dumps(param),'utf8') , headers,method='POST')
    response = urllib.request.urlopen(conn)
    page = response.read()
    page = page.decode('utf-8')
    print(page)